{
  "abilities": {
    "Living weapon": "When this Equipment enters the battlefield, create a 0/0 black Phyrexian Germ creature token, then attach this Equipment to it.",
    "Jump-start": "You may cast this card from your graveyard by discarding a card in addition to paying its other costs. Then exile this card.",
    "Commander ninjutsu": "(Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand or the command zone tapped and attacking.",
    "Legendary landwalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Nonbasic landwalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Totem armor": "If enchanted permanent would be destroyed, instead remove all damage marked on it and destroy this Aura.",
    "Megamorph": "You may cast this card face down as a 2/2 creature for 3 colorless. Turn it face up at any time for its megamorph cost and put a +1/+1 counter on it.",
    "Haunt": "When this creature dies, exile it haunting target creature.",
    "Forecast": "Activate this ability only during your upkeep and only once each turn.",
    "Graft": "This creature enters the battlefield with N +1/+1 counters on it. Whenever another creature enters the battlefield, you may move a +1/+1 counter from this creature onto it.",
    "Fortify": "Attach this Fortification to target land you control. Activate only as a sorcery.",
    "Frenzy": "Whenever this creature attacks and isn't blocked, it gets +N/+0 until end of turn.",
    "Gravestorm": "When you cast this spell, copy it for each permanent put into a graveyard this turn. You may choose new targets for the copies.",
    "Hideaway": "When this permanent enters the battlefield, look at the top N cards of your library, exile one face down, then put the rest on the bottom of your library.",
    "Level Up": "Put a level counter on this. Level up only as a sorcery.",
    "Infect": "This creature deals damage to creatures in the form of -1/-1 counters and to players in the form of poison counters.",
    "Reach": "This creature can block creatures with flying.",
    "Rampage": "Whenever this creature becomes blocked, it gets +N/+N until end of turn for each creature blocking it beyond the first.",
    "Phasing": "This phases in or out before you untap during each of your untap steps. While it's phased out, it's treated as though it doesn't exist.",
    "Multikicker": "You may pay an additional [cost] any number of times as you cast this spell.",
    "Morph": "You may cast this face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.",
    "Provoke": "Whenever this creature attacks, you may have target creature defending player controls untap and block it if able.",
    "Modular": "This enters the battlefield with N +1/+1 counters on it. When it dies, you may put its +1/+1 counters on target artifact creature.",
    "Ninjutsu": "Allows a creature that attacks and that isn't blocked to be exchanged with a Ninja in the controlling player's hand, such that the Ninja is attacking and unblocked instead of the original creature, which is returned to the owner's hand.",
    "Replicate": "When you cast this spell, copy it for each time you paid its replicate cost. You may choose new targets for the copies.",
    "Recover": "When a creature is put into your graveyard from the battlefield, you may pay [cost]. If you do, return this card from your graveyard to your hand. Otherwise, exile this card.",
    "Poisonous": "Whenever this creature deals combat damage to a player, that player gets N poison counters.",
    "Prowl": "You may cast this for its prowl cost if you dealt combat damage to a player this turn with a [subtype].",
    "Reinforce": "Discard this card: Put N +1/+1 counters on target creature.",
    "Persist": "When this creature dies, if it had no -1/-1 counters on it, return it to the battlefield under its owner’s control with a -1/-1 counter on it.",
    "Retrace": "You may cast this card from your graveyard by discarding a land card as an additional cost to cast it.",
    "Rebound": "If this spell was cast from your hand, instead of putting it into your graveyard as it resolves, exile it and, at the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.",
    "Miracle": "You may cast this card for its Miracle cost when you draw it if it's the first card you drew this turn.",
    "Overload": "You may cast this spell for its overload cost. If you do, change its text by replacing all instances of 'target' with 'each'.",
    "Outlast": "Put a +1/+1 counter on this creature. Outlast only as a sorcery.",
    "Prowess": "Whenever you cast a noncreature spell, this creature gets +1/+1 until end of turn.",
    "Renown": "Whenever this creature deals combat damage to a player, if it isn't renowned, put N +1/+1 counter on it and it becomes renowned.",
    "Myriad": "Whenever this creature attacks, for each opponent other than defending player, you may create a token that's a copy of this creature that's tapped and attacking that player or a planeswalker they control. If one or more tokens are created this way, exile the tokens at end of combat.",
    "Shroud": "This permanent or player can’t be the target of spells or abilities.",
    "Trample": "This creature can deal excess combat damage to a player, planeswalker or battle it's attacking.",
    "Vigilance": "Attacking doesn't cause this creature to tap.",
    "Shadow": "This creature can block or be blocked by only creatures with shadow.",
    "Storm": "When you cast this spell, copy it for each spell cast before it this turn. You may choose new targets for the copies.",
    "Soulshift": "When this creature dies, you may return target Spirit card with mana value N or less from your graveyard to your hand.",
    "Splice": "As you cast a(n) [quality] spell, you may reveal this card from your hand and pay its splice cost. If you do, add this card’s effects to that spell.",
    "Transmute": "Discard this card: Search your library for a card with the same mana value as this card, reveal it, put it into your hand, then shuffle. Transmute only as a sorcery.",
    "Ripple": "When you cast this spell, you may reveal the top N cards of your library. You may cast any revealed cards with the same name as this spell without paying their mana costs. Put the rest on the bottom of your library.",
    "Suspend": "Rather than cast this card from your hand, you may pay [cost] and exile it with N time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.",
    "Vanishing": "This permanent enters the battlefield with N time counters on it. At the beginning of your upkeep, remove a time counter from it. When the last is removed, sacrifice it.",
    "Transfigure": "Sacrifice this permanent: Search your library for a creature card with the same mana value as this permanent, put that card onto the battlefield, then shuffle. Transfigure only as a sorcery.",
    "Wither": "This deals damage to creatures in the form of -1/-1 counters.",
    "Undying": "When this creature dies, if it had no +1/+1 counters on it, return it to the battlefield under its owner's control with a +1/+1 counter on it.",
    "Soulbond": "You may pair this creature with another unpaired creature when either enters the battlefield. They remain paired for as long as you control both of them.",
    "Unleash": "You may have this creature enter the battlefield with a +1/+1 counter on it. It can't block as long as it has a +1/+1 counter on it.",
    "Ascend": "If you control ten or more permanents, you get the city’s blessing for the rest of the game.",
    "Assist": "Another player can pay up to {X} of this spell's cost.",
    "Afterlife": "When this creature dies, create N 1/1 white and black Spirit creature token(s) with flying.",
    "Companion": "If this card is your chosen companion, you may put it into your hand from outside the game for {3} any time you could cast a sorcery.",
    "Fabricate": "When this permanent enters the battlefield, you may put N +1/+1 counters on it. If you don't, create N 1/1 colorless Servo artifact creature tokens.",
    "Embalm": "Exile this card from your graveyard: Create a token that's a copy of it, except it's a white Zombie ... with no mana cost. Embalm only as a sorcery.",
    "Escape": "You may cast this card from your graveyard for its escape cost",
    "Fuse": "You may cast one or both halves of this card from your hand.",
    "Menace": "This creature can't be blocked except by two or more creatures.",
    "Ingest": "Whenever this creature deals combat damage to a player, that player exiles the top card of their library",
    "Melee": "Whenever this creature attacks, it gets +1/+1 until end of turn for each opponent you attacked with a creature this combat.",
    "Improvise": "Your artifacts can help cast this spell. Each artifact you tap after you're done activating mana abilities pays for {1}",
    "Mentor": "Whenever this creature attacks, put a +1/+1 counter on target attacking creature with lesser power.",
    "Partner": "You can have two commanders if both have partner.",
    "Mutate": "If you cast this spell for its mutate cost, put it over or under target non-Human creature you own. They mutate into the creature on top plus all abilities from under it.",
    "Scavenge": "Exile this card from your graveyard: Put a number of +1/+1 counters equal to this card's power on target creature. Scavenge only as a sorcery.",
    "Tribute": "As this creature enters the battlefield, an opponent of your choice may place N +1/+1 counters on it.",
    "Surge": "You may cast a spell for its surge cost if you or a teammate have cast another spell in the same turn.",
    "Skulk": "This creature can't be blocked by creatures with greater power.",
    "Undaunted": "This spell costs {1} less to cast for each opponent.",
    "Riot": "This creature enters the battlefield with your choice of a +1/+1 counter or haste.",
    "Spectacle": "You may cast this spell for its spectacle cost rather than its mana cost if an opponent lost life this turn.",
    "Forestwalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Islandwalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Mountainwalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Double strike": "This creature deals both first-strike and regular combat damage.",
    "Cumulative upkeep": "At the beginning of your upkeep, if this permanent is on the battlefield, put an age counter on this permanent. Then you may pay [cost] for each age counter on it. If you don’t, sacrifice it.",
    "First strike": "This creature deals combat damage before creatures without first strike.",
    "Encore": "Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.",
    "Deathtouch": "Any amount of damage this deals to a creature is enough to destroy it.",
    "Defender": "This creature can't attack.",
    "Amplify": "As this creature enters the battlefield, put N +1/+1 counters on it for each [creature type] card you reveal in your hand.",
    "Affinity": "This spell costs {1} less to cast for each [text] you control.",
    "Bushido": "Whenever this creature blocks or becomes blocked, it gets +N/+N until end of turn.",
    "Convoke": "Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.",
    "Bloodthirst": "If an opponent was dealt damage this turn, this permanent enters the battlefield with N +1/+1 counters on it.",
    "Absorb": "If a source would deal damage to this creature, prevent N of that damage.",
    "Aura Swap": "Exchange this Aura with an Aura card in your hand.",
    "Changeling": "This card is every creature type.",
    "Conspire": "As you cast this spell, you may tap two untapped creatures you control that share a color with it. When you do, copy it and you may choose a new target for the copy.",
    "Cascade": "When you cast this spell, exile cards from the top of your library until you exile a nonland card whose mana value is less than this spell's mana value. You may cast that card without paying its mana cost if the resulting spell's mana value is less than this spell's mana value. Then put all cards exiled this way that weren't cast on the bottom of your library in a random order.",
    "Annihilator": "Whenever this creature attacks, defending player sacrifices N permanents.",
    "Battle Cry": "Whenever this creature attacks, each other attacking creature gets +1/+0 until end of turn.",
    "Cipher": "Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of this card without paying its mana cost.",
    "Bestow": "If you cast this card for its bestow cost, it's an Aura spell with enchant creature. It becomes a creature again if it's not attached to a creature.",
    "Dash": "You may cast this spell for its dash cost. If you do, it gains haste, and it's returned from the battlefield to its owner's hand at the beginning of the next end step.",
    "Awaken": "If you cast this card for [cost], also put N +1/+1 counters on target land you control and it becomes a 0/0 Elemental creature with haste. It's still a land.",
    "Crew": "Tap any number of other untapped creatures you control with total power N or greater: This permanent becomes an artifact creature until end of turn.",
    "Aftermath": "Cast this spell only from your graveyard. Then exile it.",
    "Afflict": "Whenever this creature becomes blocked, defending player loses N life.",
    "Flanking": "Whenever a creature without flanking blocks this creature, the blocking creature gets -1/-1 until end of turn.",
    "Foretell": "During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.",
    "Fading": "This creature enters the battlefield with N fade counters on it. At the beginning of your upkeep, remove a fade counter from it. If you can't, sacrifice it.",
    "Fear": "This creature can't be blocked except by artifact creatures and/or black creatures.",
    "Eternalize": "Exile this card from your graveyard: Create a token that's a copy of it, except it's a 4/4 black Zombie ... with no mana cost. Eternalize only as a sorcery.",
    "Entwine": "Choose all if you pay the entwine cost.",
    "Epic": "For the rest of the game, you can't cast spells. At the beginning of each of your upkeeps, copy this spell except for its epic ability. You may choose new targets for the copy.",
    "Dredge": "If you would draw a card, instead you may mill N cards. If you do, return this card from your graveyard to your hand.",
    "Delve": "Each card you exile from your graveyard while casting this spell pays for {1}.",
    "Evoke": "You may cast this spell for its evoke cost. If you do, it's sacrificed when it enters the battlefield.",
    "Exalted": "Whenever a creature you control attacks alone, it gets +1/+1 until end of turn for each instance of exalted among permanents you control.",
    "Evolve": "Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.",
    "Extort": "Whenever you cast a spell, you may pay {W/B} If you do, each opponent loses 1 life and you gain that much life.",
    "Dethrone": "Whenever this creature attacks the player with the most life or tied for most life, put a +1/+1 counter on it.",
    "Exploit": "When this creature enters the battlefield, you may sacrifice a creature.",
    "Devoid": "This card has no color.",
    "Emerge": "You may cast this spell by sacrificing a creature and paying the emerge cost reduced by that creature's mana value.",
    "Escalate": "Pay this cost for each mode chosen beyond the first.",
    "Flying": "This creature can't be blocked except by creatures with flying and/or reach.",
    "Haste": "This creature can attack and {T} as soon as it comes under your control.",
    "Hexproof": "This permanent can't be the target of spells or abilities your opponents control.",
    "Indestructible": "Damage and effects that say 'destroy' don’t destroy this.",
    "Intimidate": "This creature can't be blocked except by artifact creatures and/or creatures that share a color with it.",
    "Lifelink": "Damage dealt by this creature also causes you to gain that much life.",
    "Horsemanship": "This creature can't be blocked except by creatures with horsemanship.",
    "Kicker": "You may pay an additional [cost] as you cast this spell.",
    "Madness": "If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard",
    "Swampwalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Desertwalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Plainswalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Split second": "As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.",
    "Augment": "Reveal this card from your hand: Combine it with target host. Augment only as a sorcery.",
    "Double agenda": "Start the game with this conspiracy face down in the command zone and secretly name two different cards. You may turn this conspiracy face up any time and reveal the chosen names.",
    "Reconfigure": "Attach to target creature you control; or unattach from a creature. Reconfigure only as a sorcery. While attached this isn't a creature.",
    "Ward": "Whenever this creature becomes the target of a spell or ability an opponent controls, counter it unless that player pays [cost].",
    "Partner with": "When this creature enters the battlefield, target player may put [name] into their hand from their library, then shuffle.",
    "Daybound": "If a player cast at least two spells during their own turn, it becomes day next turn.",
    "Nightbound": "If a player cast no spells during their own turn, it becomes night next turn.",
    "Decayed": "This creature can't block. When it attacks, sacrifice it at the end of combat.",
    "Disturb": "You may cast this card from your graveyard transformed for its disturb cost.",
    "Squad": "As an additional cost to cast this spell, you may pay [cost] any number of times. When this creature enters the battlefield, create that many tokens that are copies of it.",
    "Enlist": "As this creature attacks, you may tap a nonattacking creature you control without summoning sickness. When you do, add its power to this creature's until end of turn.",
    "Read Ahead": "Choose a chapter and start with that many lore counters. Add one after your draw step. Skipped chapters don't trigger. Sacrifice after III.",
    "Ravenous": "This creature enters the battlefield with X +1/+1 counters on it. If X is 5 or more, draw a card when it enters.",
    "Blitz": "If you cast this spell for its blitz cost, it gains haste and 'When this creature dies, draw a card'. Sacrifice it at the beginning of the next end step.",
    "Offering": "You may cast this card any time you could cast an instant by sacrificing a [Subtype] and paying the difference in mana costs between this and the sacrificed [Subtype]. Mana cost includes color.",
    "Living metal": "As long as it’s your turn, this Vehicle is also a creature.",
    "Backup": "When this creature enters the battlefield, put N +1/+1 counters on target creature. If that’s another creature, it gains the following abilities until end of turn.",
    "Echo": "At the beginning of your upkeep, if this came under your control since the beginning of your last upkeep, sacrifice it unless you pay its echo cost.",
    "Banding": "Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding you control are blocking or being blocked by a creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.",
    "Hidden agenda": "Start the game with this conspiracy face down in the command zone and secretly name a card. You may turn this conspiracy face up any time and reveal the chosen name.",
    "For Mirrodin!": "When this Equipment enters the battlefield, create a 2/2 red Rebel creature token, then attach this to it.",
    "Friends forever": "You can have two commanders if both have friends forever.",
    "Casualty": "As you cast this spell, you may sacrifice a creature with power N or greater. When you do, copy this spell.",
    "Protection": "This can't be blocked, targeted, dealt damage, enchanted, or equipped by anything [quality].",
    "Compleated": "[Phyrexian hybrid mana] can be paid with M, N, or 2 life. For each [Phyrexian hybrid mana] paid with life, this planeswalker enters with two fewer loyalty counters.",
    "Devour": "As this enters the battlefield, you may sacrifice any number of creatures. This creature enters the battlefield with N times that many +1/+1 counters on it.",
    "Enchant": "This card can only be attached to an [object or player].",
    "Flash": "You may cast this spell any time you could cast an instant.",
    "Boast": "Activate this ability only if this creature attacked this turn and only once each turn.",
    "Landwalk": "This creature can't be blocked as long as defending player controls a [type].",
    "Demonstrate": "When you cast this spell, you may copy it. If you do, choose an opponent to also copy it. Players may choose new targets for their copies.",
    "Sunburst": "This enters the battlefield with a [+1/+1 or charge] counter on it for each color of mana spent to cast it.",
    "Flashback": "You may cast this card from your graveyard for its flashback cost. Then exile it.",
    "Cycling": "Discard this card: Draw a card.",
    "Equip": "Attach this permanent to target [quality] creature you control. Activate this ability only any time you could cast a sorcery.",
    "Buyback": "You may pay an additional [cost] as you cast this spell. If the buyback cost was paid, put this spell into its owner’s hand instead of into that player’s graveyard as it resolves.",
    "Hexproof from": "This permanent can't be the target of [quality] spells your opponents control or abilities of [quality] sources your opponents control.",
    "More Than Meets the Eye": "You may cast this card converted for [cost]",
    "Cleave": "You may cast this spell for its cleave cost. If you do, remove the words in square brackets.",
    "Champion": "When this enters the battlefield, sacrifice it unless you exile another creature you control. When this leaves the battlefield, that card returns to the battlefield.",
    "Specialize": "Pay [cost], choose a color, discard a card of that color or associated basic land type: This creature perpetually specializes into that color. Activate only as a sorcery.",
    "Training": "Whenever this creature attacks with another creature with greater power, put a +1/+1 counter on this creature.",
    "Prototype": "You may cast this spell with different mana cost, color, and size. It keeps its abilities and types.",
    "Toxic": "Players dealt combat damage by this creature also get N poison counter(s).",
    "Unearth": "Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.",
    "Intensity": "Intensity is a card designation that starts at a certain value (Starting Intensity) and will perpetually change based on the card's rules text",
    "Plainscycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Swampcycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Typecycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Wizardcycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Mountaincycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Basic landcycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Islandcycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Forestcycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Slivercycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Landcycling": "Discard this card: Search your library for a [type] card, reveal it, and put it into your hand. Then shuffle your library.",
    "Bargain": "You may sacrifice an artifact, enchantment, or token as you cast this spell."
  },
  "actions": {
    "Seek": "To seek a card, put one at random from your library into your hand.",
    "Activate": "",
    "Attach": "",
    "Cast": "",
    "Counter": "",
    "Create": "",
    "Destroy": "",
    "Discard": "",
    "Double": "",
    "Exchange": "",
    "Exile": "",
    "Adapt": "If this creature has no +1/+1 counters on it, put N +1/+1 counter(s) on it.",
    "Support": "Put a +1/+1 counter on each of up to N (other) target creatures.",
    "Play": "",
    "Regenerate": "The next time this creature would be destroyed this turn, it isn't. Instead tap it, remove all damage from it, and remove it from combat.",
    "Reveal": "",
    "Sacrifice": "",
    "Shuffle": "",
    "Tap": "",
    "Untap": "",
    "Vote": "",
    "Goad": "Until your next turn, that creature attacks each combat if able and attacks a player other than you if able.",
    "Transform": "Transform means to turn a double-faced card on the back side, changing the card face that is visible.",
    "Surveil": "Look at the top N cards of your library, then put any number of them into your graveyard and the rest on top of your library in any order.",
    "Planeswalk": "Planeswalk means to put each face-up plane card or phenomenon card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up in a Planechase game.",
    "Mill": "Put the top N cards from the library into your/their graveyard.",
    "Learn": "You may reveal a Lesson card you own from outside the game and put it into your hand, or discard a card to draw a card.",
    "Connive": "Draw N cards, then discard N cards. Put a +1/+1 counter on this creature for each nonland card discarded this way.",
    "Venture into the dungeon": "If you’re in a dungeon, advance to the next room. If you’re not, enter [quality]. Enter the first room or advance to the next room",
    "Exert": "An exerted permanent won't untap during your next untap step.",
    "Open an Attraction": "Put the top card of your Attraction deck onto the battlefield.",
    "Food": "{2}, {tap}, Sacrifice this artifact: You gain 3 life.",
    "Conjure": "A conjured card is added to the game.",
    "Abandon": "Abandon is a keyword action which is only used in the Archenemy format. Together with set in motion it is used to interact with Schemes. It means to turn a face-up ongoing scheme card face down and put it on the bottom of its owner’s scheme deck. ",
    "Explore": "Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back on top or into your graveyard.",
    "Amass": "Put N +1/+1 counters on an Army you control. It’s also a [subtype]. If you don’t control an Army, create a 0/0 black [subtype] Army creature token first.",
    "Treasure": "{tap}, Sacrifice this artifact: Add one mana of any color.",
    "Roll to Visit Your Attractions": "To roll to visit your Attractions, roll a six-sided die. Then if you control one or more Attractions with a number lit up that is equal to that result, each of those Attractions has been “visited” and its visit ability triggers.",
    "Set in motion": "Set in Motion is a keyword action which is only used in the Archenemy format. Together with abandon it is used to interact with Schemes. To set into motion means to move a scheme card off the top of your scheme deck and turn it face up.",
    "Fateseal": "To fateseal N, look at the top N cards of an opponent's library, then put any number of them on the bottom of that player's library and the rest on top in any order.",
    "Manifest": "Put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.",
    "Populate": "Create a token that's a copy of a creature token you control.",
    "Detain": "Until your next turn, that permanent can't attack or block and its activated abilities can't be activated.",
    "Investigate": "Create a colorless Clue artifact token with '{2}, Sacrifice this artifact: Draw a card.'",
    "Monstrosity": "If this permanent isn't monstrous, put N +1/+1 counters on it and it becomes monstrous.",
    "Clash": "Each clashing player reveals the top card of their library, then puts that card on the top or bottom. A player wins if their card had a higher mana value.",
    "Scry": "Look at the top N cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.",
    "Incubate": "Create an Incubator token with N +1/+1 counters on it and “{2}: Transform this artifact. It transforms into a 0/0 Phyrexian artifact creature.",
    "Proliferate": "Choose any number of permanents and/or players, then give each another counter of each kind already there.",
    "Meld": "Meld is a keyword action that means to turn two meld cards on the back side into one oversized card, if you control the proper pair.",
    "Convert": "Convert is a keyword action introduced in Transformers and means to turn a double-faced card to the opposite face. It is exactly the same as Transform.",
    "Fight": "Fight [a creature] (Each deals damage equal to its power to the other.)",
    "Bolster": "Choose a creature you control with the least toughness or tied for the least toughness among creatures you control. Put N +1/+1 counters on that creature.",
    "Assemble": "To assemble a Contraption, put the top card of your Contraption deck face up onto one of your sprockets.",
    "Role token": ""
  }
}